app/Controllers/ActiviteController.php

    public function index()
    {
        $activiteModel = new ActiviteModel();
        $activites = $activiteModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `activites`
ORDER BY `id` DESC