app/Controllers/AuthController.php

    public function login()
    {
        // Validation basique
        $rules = [
            'email' => 'required|valid_email',
            'mot_de_passe' => 'required|min_length[8]'
        ];

        if (!$this->validate($rules)) {
            return view('auth/login', [
                'erreurs' => $this->validator->getErrors()
            ]);
        }

        $email = $this->request->getPost('email');
        $motDePasse = $this->request->getPost('mot_de_passe');

        // ===== VÉRIFIER D'ABORD SI C'EST UN ADMIN =====
        $adminModel = new AdminModel();
        $admin = $adminModel->where('email', $email)->first();
---
SELECT *
FROM `admins`
WHERE `email` = 'admin@projet.mg'
 LIMIT 1


        // ===== SINON VÉRIFIER SI C'EST UN UTILISATEUR NORMAL =====
        $utilisateurModel = new UtilisateurModel();
        $user = $utilisateurModel->where('email', $email)->first();
---
SELECT *
FROM `utilisateurs`
WHERE `email` = 'admin@projet.mg'
 LIMIT 1