app/Controllers/DashboardController.php

    public function index()
    {
        $utilisateurModel = new UtilisateurModel();
        $abonnementModel = new AbonnementModel();
        $regimeModel = new RegimeModel();
        $creditModel = new CreditModel();

        // Statistiques générales
        $stats = [
            'total_users' => $utilisateurModel->countAll(),
            'gold_users' => $utilisateurModel->where('est_gold', 1)->countAllResults(),
            'total_subscriptions' => $abonnementModel->countAll(),
            'active_subscriptions' => $abonnementModel->where('date_fin >=', date('Y-m-d'))->countAllResults(),
            'total_regimes' => $regimeModel->where('est_actif', 1)->countAllResults(),
        ];

        // Statistiques financières
        $creditsUsed = $creditModel->where('est_utilise', 1)->selectSum('montant')->first();
        $stats['total_revenue'] = $creditsUsed['montant'] ?? 0;

        // Revenue from gold subscriptions
        $goldRevenue = $abonnementModel->selectSum('prix_paye')
            ->where('remise_gold_appliquee', 1)->first();
        $stats['gold_revenue'] = $goldRevenue['prix_paye'] ?? 0;

        // Utilisateurs par objectif
        $objectifs = $utilisateurModel->select('objectif_actuel')
            ->where('objectif_actuel !=', null)
            ->groupBy('objectif_actuel')
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `utilisateurs`
WHERE `est_gold` = 1
SELECT COUNT(*) AS `numrows` FROM `abonnements`
SELECT COUNT(*) AS `numrows`
FROM `abonnements`
WHERE `date_fin` >= '2026-05-11'
SELECT COUNT(*) AS `numrows`
FROM `regimes`
WHERE `est_actif` = 1
SELECT SUM(`prix_paye`) AS `prix_paye`
FROM `abonnements`
WHERE `remise_gold_appliquee` = 1
 LIMIT 1
SELECT `objectif_actuel`
FROM `utilisateurs`
WHERE `objectif_actuel` IS NOT NULL
GROUP BY `objectif_actuel`

        $data['objectif_stats'] = [];
        foreach ($objectifs as $obj) {
            if (!empty($obj['objectif_actuel'])) {
                $count = $utilisateurModel->where('objectif_actuel', $obj['objectif_actuel'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `utilisateurs`
WHERE `objectif_actuel` = 'augmenter'

        }

        // Régimes les plus populaires
        $regimesPopulaires = $abonnementModel->select('regime_id')
            ->groupBy('regime_id')
            ->get()
            ->getResultArray();

        $data['regimes_populaires'] = [];
        foreach ($regimesPopulaires as $sub) {
            $regime = $regimeModel->find($sub['regime_id']);
            $count = $abonnementModel->where('regime_id', $sub['regime_id'])->countAllResults();
---
SELECT `regime_id`
FROM `abonnements`
GROUP BY `regime_id`
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = '4'
SELECT COUNT(*) AS `numrows`
FROM `abonnements`
WHERE `regime_id` = '4'

        }

        // Progrès moyen des utilisateurs
        $abonnements = $abonnementModel->select('poids_depart, poids_cible')
            ->where('poids_depart !=', null)
            ->where('poids_cible !=', null)
            ->findAll();
---
SELECT `poids_depart`, `poids_cible`
FROM `abonnements`
WHERE `poids_depart` IS NOT NULL
AND `poids_cible` IS NOT NULL

        }

        // Taux de succès
        $abonnementsSuccess = $abonnementModel->select('poids_depart, poids_cible')
            ->where('poids_depart !=', null)
            ->where('poids_cible !=', null)
            ->findAll();
---
SELECT `poids_depart`, `poids_cible`
FROM `abonnements`
WHERE `poids_depart` IS NOT NULL
AND `poids_cible` IS NOT NULL

        }

        // Distribution par genre
        $genres = $utilisateurModel->select('genre')
            ->where('genre !=', null)
            ->groupBy('genre')
            ->findAll();
---
SELECT `genre`
FROM `utilisateurs`
WHERE `genre` IS NOT NULL
GROUP BY `genre`

        $data['genre_stats'] = [];
        foreach ($genres as $genre) {
            if (!empty($genre['genre'])) {
                $count = $utilisateurModel->where('genre', $genre['genre'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `utilisateurs`
WHERE `genre` = 'homme'