app/Controllers/InscriptionController.php

    public function finaliser()
    {
        $model = new UtilisateurModel();
        $userId = session()->get('user_id');
        if (! $userId) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Utilisateur non spécifié');
        }

        $data = [
            'taille_cm' => $this->request->getPost('taille_cm'),
            'poids_actuel' => $this->request->getPost('poids_actuel'),
        ];

        if (! $model->validate($data, 'validationRulesEtape2')) {
            return view('inscription_etape2', [
                'erreurs' => $model->errors(),
                'userId' => $userId
            ]);
        }

        $model->set($data)->where('id', $userId)->update();
---
UPDATE `utilisateurs` SET `taille_cm` = '145', `poids_actuel` = '80'
WHERE `utilisateurs`.`id` IN (10)

    public function profil()
    {
        $user = session()->get('user');
        if (! $user || ! isset($user['id'])) {
            return redirect()->to('/login');
        }

        $model = new UtilisateurModel();
        $utilisateur = $model->find($user['id']);
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 9

    public function edit()
    {
        $user = session()->get('user');
        if (! $user || ! isset($user['id'])) {
            return redirect()->to('/login');
        }

        $model = new UtilisateurModel();
        $utilisateur = $model->find($user['id']);
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 10

    public function update()
    {
        $user = session()->get('user');
        if (! $user || ! isset($user['id'])) {
            return redirect()->to('/login');
        }

        $model = new UtilisateurModel();
        $userId = $user['id'];

        $utilisateur = $model->find($userId);
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = '6'