app/Controllers/ParametreController.php

SELECT *
FROM `parametres`
ORDER BY `cle_param`
---
    public function index()
    {
        $model = new ParametreModel();
        $params = $model->orderBy('cle_param')->findAll();