app/Controllers/RegimeController.php

    public function index()
    {
        $regimeModel = new RegimeModel();
        $regimes = $regimeModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `regimes`
ORDER BY `id` DESC

    public function edit($id)
    {
        $regimeModel = new RegimeModel();
        $regime = $regimeModel->find($id);
---
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = '6'

    public function update($id)
    {
        $regimeModel = new RegimeModel();
        if (!$regimeModel->find($id)) {
            return redirect()->to('/admin/regimes')->with('errors', ['Régime introuvable.']);
        }

        $data = [
            'nom' => trim((string) $this->request->getPost('nom')),
            'description' => trim((string) $this->request->getPost('description')),
            'pct_viande' => (float) $this->request->getPost('pct_viande'),
            'pct_poisson' => (float) $this->request->getPost('pct_poisson'),
            'pct_volaille' => (float) $this->request->getPost('pct_volaille'),
            'variation_kg_semaine' => (float) $this->request->getPost('variation_kg_semaine'),
            'est_actif' => $this->request->getPost('est_actif') ? 1 : 0,
        ];

        if ($regimeModel->update($id, $data) === false) {
---
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = '6'
UPDATE `regimes` SET `nom` = 'Régime Athlète', `description` = 'Régime haute performance pour sportifs', `pct_viande` = 20, `pct_poisson` = 30, `pct_volaille` = 35, `variation_kg_semaine` = 0.6, `est_actif` = 1
WHERE `regimes`.`id` IN ('6')