app/Controllers/SuggestionController.php

    public function index()
    {
        $userId = session()->get('user')['id'] ?? null;
        if (!$userId) return redirect()->to('/login');

        $utilisateurModel = new UtilisateurModel();
        $utilisateur = $utilisateurModel->find($userId);
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = '6'