app/Models/ActiviteModel.php

SELECT *
FROM `activites`
WHERE `intensite` = 'moderee'
AND `est_actif` = 1
---
    public function getActivitesParIntensite($intensite)
    {
        return $this->where('intensite', $intensite)
                    ->where('est_actif', 1)
                    ->findAll();