app/Models/RegimeModel.php

    public function getRegimesParObjectif($objectif)
    {
        $builder = $this->builder();
        $builder->where('est_actif', 1);

        if ($objectif === 'reduire') {
            $builder->where('variation_kg_semaine <', 0);
        } elseif ($objectif === 'augmenter') {
            $builder->where('variation_kg_semaine >', 0);
        }

        return $builder->get()->getResultArray();
---
SELECT *
FROM `regimes`
WHERE `est_actif` = 1
AND `variation_kg_semaine` > 0