app/Models/RegimePrixModel.php

    public function getPalierPrix($regimeId, $nbSemaines)
    {
        $builder = $this->builder();
        $builder->where('regime_id', $regimeId)
                ->where('nb_semaines >=', $nbSemaines)
                ->orderBy('nb_semaines', 'ASC')
                ->limit(1);

        $result = $builder->get()->getRowArray();

        // Si aucun palier assez grand n'est trouvé, on prend le palier maximum existant
        if (!$result) {
            $builder = $this->builder();
            $builder->where('regime_id', $regimeId)
                    ->orderBy('nb_semaines', 'DESC')
                    ->limit(1);
            $result = $builder->get()->getRowArray();
---
SELECT *
FROM `regime_prix`
WHERE `regime_id` = '2'
AND `nb_semaines` >= 25
ORDER BY `nb_semaines` ASC
 LIMIT 1
SELECT *
FROM `regime_prix`
WHERE `regime_id` = '2'
ORDER BY `nb_semaines` DESC
 LIMIT 1