app/Models/UtilisateurModel.php

    public function getIMC($id)
    {
        $utilisateur = $this->find($id);
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 9

    public function getPoidsIdeal($id)
    {
        $utilisateur = $this->find($id);
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 9